w4kpm/stm32f429-discovery-chibios-pppos/main.c
/*
    ChibiOS - Copyright (C) 2006..2015 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/


#include "lwip/sockets.h"
#include "lwip/tcpip.h"

#include "socketstreams.h"

#include "ch.h"
#include "hal.h"
#include "stdio.h"
#include "string.h"
#include "stdlib.h"
#include "chprintf.h"
#include "shell.h"
#include "sysinfo.h"
#include "lwip/sockets.h"
#include <string.h>
#include "ppp/ppp.h"
#include "stm32f4xx.h"

//#include "lwipthread.h"
static uint8_t txbuf[2];
static uint8_t rxbuf[2];
static char text[255];

static const SPIConfig std_spicfg1 = {
  NULL,
  GPIOC,                                                        /*port of CS  */
  2,                                                /*pin of CS   */
  SPI_CR1_CPOL|SPI_CR1_CPHA| \
  SPI_CR1_SPE|SPI_CR1_MSTR|SPI_CR1_BIDIMODE ,
  NULL
};

/*
The interface to the LCD controller appears to be bidirectional - and you have to do some stuff to set it up before it will take parallel info from the lcd controller from STM32 - it may be best to work on connecting to VNC server and speed issues before messing with the screwy SPI stuff with this display.
*/


void init_spi()
{
//  palSetPadMode(GPIOA, CS, PAL_MODE_OUTPUT_PUSHPULL);
    // palSetPadMode(GPIOA, CS2, PAL_MODE_OUTPUT_PUSHPULL);
    // palSetPadMode(GPIOB, CK, PAL_MODE_OUTPUT_PUSHPULL);
    // palSetPadMode(GPIOB, MISO, PAL_MODE_INPUT_PULLDOWN);
    //palSetPadMode(GPIOB, MOSI, PAL_MODE_OUTPUT_PUSHPULL);
    //palSetPad(GPIOA,CS);
    //palSetPad(GPIOA,CS2);
    // palClearPad(GPIOB,CK);

}
uint8_t spi_read(device,location)
{
  spiStart(&SPID5,device);
  spiSelect(&SPID5);
  txbuf[0] = 0x80 | location;
  spiSend(&SPID5,1,&txbuf);
  spiReceive(&SPID5,1,&rxbuf);
  spiUnselect(&SPID5);
  spiStop(&SPID5);
  return(rxbuf[0]);
}
void spi_write(device,location,data)
{
  spiStart(&SPID5,device);
  spiSelect(&SPID5);
  txbuf[0] = 0x00 | location;
  txbuf[1] = data;
  spiSend(&SPID5,2,&txbuf);
  spiUnselect(&SPID5);
  spiStop(&SPID5);
}





mutex_t SD3mtx;
void TFTLCD_Init(void);
/* stolen from a version of sys_arch I found on wizhippo's github 

https://github.com/wizhippo/stm32f4-chibios-lwip-pppos.git
*/
u32_t sys_jiffies(void) {
	static u32_t jiffies = 0;
#if OSAL_ST_FREQUENCY == 1000
	jiffies += (u32_t)osalOsGetSystemTimeX();
#elif (OSAL_ST_FREQUENCY / 1000) >= 1 && (OSAL_ST_FREQUENCY % 1000) == 0
	jiffies += ((u32_t)osalOsGetSystemTimeX() - 1) / (OSAL_ST_FREQUENCY / 1000) + 1;
#elif (1000 / OSAL_ST_FREQUENCY) >= 1 && (1000 % OSAL_ST_FREQUENCY) == 0
	jiffies += ((u32_t)osalOsGetSystemTimeX() - 1) * (1000 / OSAL_ST_FREQUENCY) + 1;
#else
	jiffies += (u32_t)(((u64_t)(osalOsGetSystemTimeX() - 1) * 1000) / OSAL_ST_FREQUENCY) + 1;
#endif

	return jiffies;
}


#define LCD_WIDTH	 320
#define LCD_HEIGHT	240

#define HFP   16
#define HSYNC 96
#define HBP   48

#define VFP   10
#define VSYNC 2
#define VBP   33

#define ACTIVE_W (HSYNC + LCD_WIDTH + HBP - 1)
#define ACTIVE_H (VSYNC + LCD_HEIGHT + VBP - 1)

#define TOTAL_WIDTH  (HSYNC + HBP + LCD_WIDTH + HFP - 1)
#define TOTAL_HEIGHT (VSYNC + VBP + LCD_HEIGHT + VFP - 1)
#define PIXELWIDHT 2
static SerialConfig uartCfg =
{
    460800,// bit rate
    0,
    0,
    0,
};
/*
 * Application entry point.
 */


static THD_WORKING_AREA(waThread1, 128);
static THD_FUNCTION(Thread1, arg) {
  (void)arg;
  int pass = 0;
  chRegSetThreadName("Thread1");

  while (TRUE) {
    palSetPad(GPIOG, 13);       /* Green.  */
    chThdSleepMilliseconds(500);
    palClearPad(GPIOG, 13);     /* Green.  */
    chThdSleepMilliseconds(500);
  }

	return MSG_OK;
}


#ifndef SOCK_TARGET_HOST
#define SOCK_TARGET_HOST  "172.30.1.98"
#endif

#ifndef SOCK_TARGET_PORT
#define SOCK_TARGET_PORT  5901
#endif



/*
 * Shell related
 */
#define SHELL_WA_SIZE   THD_WORKING_AREA_SIZE(1024)

static const ShellCommand shell_commands[] = {
	SYSINFO_SHELL_COMMANDS,
	{NULL, NULL}
};

char vncbuffer[2048]; // shouldn't ever get more than 1024
int vncsocket;

void log_data(char* text)
{
    return;
    chprintf((BaseSequentialStream*)&SD3,text);
}

void log_data_num(char* text,int data)
{
    return;
    chprintf((BaseSequentialStream*)&SD3,text,data);
}


void ensure_bytes(uint16_t numbytes)
{
    // I had problems with recv not returning the number of bytes that 
    // I requested - I am assuming that recv also returns when it hits the 
    // end of a packet, not neccecerily when it gets the number of bytes requested.
    // In order to get the required number of bytes, I loop until I have read everything
    // I asked for.
    int currentbytes;
    uint16_t readbytes,neededbytes;
    uint8_t *buffpos;

    readbytes =0;
    neededbytes = numbytes;
    buffpos = &vncbuffer;
    while (readbytes < numbytes)
	{
	    //chThdSleepMilliseconds(10);
	    //log_data_num("we need %d \r\n",neededbytes);
	    //log_data_num("we have %d \r\n",readbytes);
	    currentbytes=lwip_recv(vncsocket,(uint8_t *)buffpos+readbytes,neededbytes,0);
	    if (currentbytes < 0)
		{
		    log_data_num("we got an error reading %d \r\n",currentbytes);
		    return;
		}
	    //log_data_num("we read %d \r\n",currentbytes);
	    readbytes += currentbytes;
	    neededbytes -= currentbytes;
	}	
}




void write_byte(uint8_t x){
    int numbytes;
    numbytes=lwip_send(vncsocket,&x,1,0);
    if (numbytes != 1)
	log_data("writeByte Incorrect length\r\n");
}

void write_string(char *str)
{
    int numbytes;
    numbytes=lwip_send(vncsocket,str,strlen(str),0);
    if (numbytes != strlen(str))
	log_data("writeString Incorrect length\r\n");

